# Project 2: Exact, Transform, Load
## Housing market fluctations in four major cities of Texas - Rental Prices

### Group 2 Team Members:
* Shwet 'Sunny' Bhatt - ETL Houston Housing Price information
* Waynette Burke - ETL San Antonio and Houston Rental Information
* Ariana Garcia - ETL San Antonio Housing Price Information

In [1]:
#Import Dependency
import pandas as pd
import pymongo

In [2]:
# Automates browser actions
from splinter import Browser

# Parses the HTML
from unicodedata import normalize

# For scraping with Chrome
from webdriver_manager.chrome import ChromeDriverManager

### Establish a connection

In [3]:
# Initialize PyMongo to work with MongoDBs
client = pymongo.MongoClient('mongodb://localhost:27017')

In [4]:
# Define database
db = client.HousingMarket_db

#Creating collection("table") rentedInfo
coll_Rented = db.rentedInfo


#Creating collection("table") OwnedInfo
coll_Owned = db.OwnedInfo

In [5]:
#Dropping Database and Collection if exist
coll_Rented.drop()
coll_Owned.drop()

### Reading the CSV File for extraction

In [6]:
#CSV File to be extracted
houseRent = "Resources/Metro_zori_sm_month.csv"

#Read in CSV file
rental = pd.read_csv(houseRent)

In [7]:
#View of the imported CSV that was converted to a dataframe
rental.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2015-03-31,2015-04-30,2015-05-31,2015-06-30,2015-07-31,...,2021-11-30,2021-12-31,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31
0,102001,0,United States,country,NaN,1379.359350,1391.073873,1401.530422,1412.396507,1418.136828,...,1926.501816,1940.496249,1948.801048,1966.495998,1982.244729,2008.780414,2030.844688,2055.759958,2076.446338,2089.775788
1,394913,1,"New York, NY",msa,NY,2519.219640,2546.687664,2566.288864,2583.939076,2586.989228,...,2943.972800,2967.725193,2995.408435,3043.726843,3096.093502,3155.667377,3214.734293,3272.366446,3322.750066,3341.555894
2,753899,2,"Los Angeles, CA",msa,CA,1984.656244,1997.410467,2011.539491,2024.112854,2038.440690,...,2800.991074,2818.584204,2835.348908,2859.616662,2891.533834,2929.352690,2963.407518,2989.180066,3009.899282,3023.599107
3,394463,3,"Chicago, IL",msa,IL,1508.976397,1522.121857,1534.084115,1561.018730,1568.264918,...,1826.037645,1833.685056,1846.498235,1862.123404,1881.300441,1904.071425,1929.775478,1951.121693,1970.803363,1979.473043
4,394514,4,"Dallas, TX",msa,TX,1183.209930,1193.705541,1205.093370,1212.123457,1218.724732,...,1720.058793,1730.702831,1741.993929,1752.658761,1762.695569,1784.917301,1811.899478,1846.581556,1870.973903,1881.637168

In [8]:
#Snapshot of the column names to allow for selecting what is required for this analysis
rental.columns

Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
       '2015-03-31', '2015-04-30', '2015-05-31', '2015-06-30', '2015-07-31',
       '2015-08-31', '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31',
       '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30', '2016-05-31',
       '2016-06-30', '2016-07-31', '2016-08-31', '2016-09-30', '2016-10-31',
       '2016-11-30', '2016-12-31', '2017-01-31', '2017-02-28', '2017-03-31',
       '2017-04-30', '2017-05-31', '2017-06-30', '2017-07-31', '2017-08-31',
       '2017-09-30', '2017-10-31', '2017-11-30', '2017-12-31', '2018-01-31',
       '2018-02-28', '2018-03-31', '2018-04-30', '2018-05-31', '2018-06-30',
       '2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31', '2018-11-30',
       '2018-12-31', '2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
       '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31', '2019-09-30',
       '2019-10-31', '2019-11-30', '2019-12-31', '2020-01-31', '2020-02-29',
       '2020-03-31', '2020-04-30', '2020-05-31', '2020-06-30', '2020-07-31',
       '2020-08-31', '2020-09-30', '2020-10-31', '2020-11-30', '2020-12-31',
       '2021-01-31', '2021-02-28', '2021-03-31', '2021-04-30', '2021-05-31',
       '2021-06-30', '2021-07-31', '2021-08-31', '2021-09-30', '2021-10-31',
       '2021-11-30', '2021-12-31', '2022-01-31', '2022-02-28', '2022-03-31',
       '2022-04-30', '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31'],
      dtype='object')

In [9]:
#Collecting data for the four Texas Cities: Dallas, Austin, San Antonio and Houston
texas_rental = rental.loc[((rental["RegionName"] == "Houston, TX") |
                                 (rental["RegionName"] == "San Antonio, TX")),:]
texas_rental.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2015-03-31,2015-04-30,2015-05-31,2015-06-30,2015-07-31,...,2021-11-30,2021-12-31,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31
5,394692,5,"Houston, TX",msa,TX,1266.485274,1276.757481,1285.512422,1294.301128,1298.504212,...,1545.519707,1556.718879,1556.678364,1564.092063,1569.778502,1584.517983,1598.195718,1612.944456,1625.251711,1632.930432
24,395055,24,"San Antonio, TX",msa,TX,1036.962690,1045.293207,1054.488948,1061.745970,1065.038288,...,1432.520254,1438.136386,1442.200762,1452.625453,1456.879987,1472.082994,1487.993268,1505.683417,1521.742595,1527.103719

In [10]:
#Filtering of the columns: Needing only data for the year 2021
reduced_rental = texas_rental[['RegionName','2021-01-31', '2021-02-28', '2021-03-31', '2021-04-30', '2021-05-31',
       '2021-06-30', '2021-07-31', '2021-08-31', '2021-09-30', '2021-10-31',
       '2021-11-30', '2021-12-31']]

reduced_rental.head()

,RegionName,2021-01-31,2021-02-28,2021-03-31,2021-04-30,2021-05-31,2021-06-30,2021-07-31,2021-08-31,2021-09-30,2021-10-31,2021-11-30,2021-12-31
5,"Houston, TX",1385.370824,1381.69660,1387.381925,1400.492020,1427.686387,1459.167326,1491.475150,1518.166502,1530.272085,1540.927833,1545.519707,1556.718879
24,"San Antonio, TX",1244.323792,1246.63651,1256.555388,1272.033387,1293.879012,1319.928451,1350.828315,1387.116050,1415.238489,1430.159529,1432.520254,1438.136386

In [11]:
#Transpose the table data
transposed_house = reduced_rental.transpose()

#Reset the index so that the "Date" field is no longer considered as an Index
transposed_house = transposed_house.reset_index()

#renamed the columns
transposed_house = transposed_house.set_axis(["Date", "Houston,TX", "San Antonio, TX"], axis = "columns") 

# remove the first row which was the old header
transposed_house = transposed_house.drop([0])

#View of the modified dataframe
transposed_house.head()

         Date   Houston,TX San Antonio, TX
1  2021-01-31  1385.370824     1244.323792
2  2021-02-28    1381.6966      1246.63651
3  2021-03-31  1387.381925     1256.555388
4  2021-04-30   1400.49202     1272.033387
5  2021-05-31  1427.686387     1293.879012

In [12]:
#Cleaning up the formatting of the data in the dataframe
transposed_house["Date"] =transposed_house["Date"].astype("datetime64")
transposed_house["Houston,TX"] = transposed_house["Houston,TX"].astype(float).map("${:,.2f}".format)
transposed_house["San Antonio, TX"] = transposed_house["San Antonio, TX"].astype(float).map("${:,.2f}".format)

transposed_house.head()

        Date Houston,TX San Antonio, TX
1 2021-01-31  $1,385.37       $1,244.32
2 2021-02-28  $1,381.70       $1,246.64
3 2021-03-31  $1,387.38       $1,256.56
4 2021-04-30  $1,400.49       $1,272.03
5 2021-05-31  $1,427.69       $1,293.88

### Adding dataframe to MongoDB

In [13]:
#Updating the MondoDB Collection with the data in the dataframe

rental_dict ={}

for row in transposed_house.index:
    #Creating the dictionary for the items in the dataframe
    rental_dict= {"date":transposed_house["Date"][row],
                  "Houston":transposed_house["Houston,TX"][row],
                  "San Antonio":transposed_house["San Antonio, TX"][row]}
    
    #Adding the dictionary to the database collection
    coll_Rented.insert_one(rental_dict)

In [14]:
# Display items in MongoDB collection
rentalTable = db.rentedInfo.find()

for entry in rentalTable:
    print(entry)

{'_id': ObjectId('6323f9d944646eea70730d54'), 'date': datetime.datetime(2021, 1, 31, 0, 0), 'Houston': '$1,385.37', 'San Antonio': '$1,244.32'}
{'_id': ObjectId('6323f9da44646eea70730d55'), 'date': datetime.datetime(2021, 2, 28, 0, 0), 'Houston': '$1,381.70', 'San Antonio': '$1,246.64'}
{'_id': ObjectId('6323f9da44646eea70730d56'), 'date': datetime.datetime(2021, 3, 31, 0, 0), 'Houston': '$1,387.38', 'San Antonio': '$1,256.56'}
{'_id': ObjectId('6323f9da44646eea70730d57'), 'date': datetime.datetime(2021, 4, 30, 0, 0), 'Houston': '$1,400.49', 'San Antonio': '$1,272.03'}
{'_id': ObjectId('6323f9da44646eea70730d58'), 'date': datetime.datetime(2021, 5, 31, 0, 0), 'Houston': '$1,427.69', 'San Antonio': '$1,293.88'}
{'_id': ObjectId('6323f9da44646eea70730d59'), 'date': datetime.datetime(2021, 6, 30, 0, 0), 'Houston': '$1,459.17', 'San Antonio': '$1,319.93'}
{'_id': ObjectId('6323f9da44646eea70730d5a'), 'date': datetime.datetime(2021, 7, 31, 0, 0), 'Houston': '$1,491.48', 'San Antonio': '$1,350.83'}
{'_id': ObjectId('6323f9da44646eea70730d5b'), 'date': datetime.datetime(2021, 8, 31, 0, 0), 'Houston': '$1,518.17', 'San Antonio': '$1,387.12'}
{'_id': ObjectId('6323f9da44646eea70730d5c'), 'date': datetime.datetime(2021, 9, 30, 0, 0), 'Houston': '$1,530.27', 'San Antonio': '$1,415.24'}
{'_id': ObjectId('6323f9da44646eea70730d5d'), 'date': datetime.datetime(2021, 10, 31, 0, 0), 'Houston': '$1,540.93', 'San Antonio': '$1,430.16'}
{'_id': ObjectId('6323f9da44646eea70730d5e'), 'date': datetime.datetime(2021, 11, 30, 0, 0), 'Houston': '$1,545.52', 'San Antonio': '$1,432.52'}
{'_id': ObjectId('6323f9da44646eea70730d5f'), 'date': datetime.datetime(2021, 12, 31, 0, 0), 'Houston': '$1,556.72', 'San Antonio': '$1,438.14'}

## WebScraping Data

### Houston and Surrounding Areas

In [15]:
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

In [16]:
url = "https://www.recenter.tamu.edu/data/housing-activity/#!/activity/MSA/Houston-The_Woodlands-Sugar_Land"
    
# Call visit on our browser and pass in the URL we want to scrape   
browser.visit(url)

In [17]:
table_data = browser.find_by_xpath('//*[@id="WebPartWPQ1"]/div[1]/div/div[2]/table').text
table_data[0]
table_data_split = table_data.split(" ")
table_data_split

['Date',
 'Sales',
 'Dollar\nVolume',
 'Average\nPrice',
 'Median\nPrice',
 'Total\nListings',
 'Months\nInventory\nJan',
 '1990',
 '2,500',
 '214,427,500',
 '85,771',
 '45,500',
 '22,318',
 '8.9\nFeb',
 '1990',
 '1,935',
 '171,518,400',
 '88,640',
 '66,231',
 '23,191',
 '10.5\nMar',
 '1990',
 '2,554',
 '219,963,250',
 '86,125',
 '67,052',
 '24,247',
 '10.4\nApr',
 '1990',
 '2,434',
 '221,267,638',
 '90,907',
 '66,949',
 '24,709',
 '10.5\nMay',
 '1990',
 '2,999',
 '258,048,955',
 '86,045',
 '65,923',
 '25,390',
 '10.2\nJun',
 '1990',
 '3,204',
 '295,988,724',
 '92,381',
 '70,439',
 '25,023',
 '9.6\nJul',
 '1990',
 '3,122',
 '285,072,942',
 '91,311',
 '69,618',
 '25,153',
 '9.4\nAug',
 '1990',
 '3,627',
 '337,151,412',
 '92,956',
 '69,310',
 '24,280',
 '8.7\nSep',
 '1990',
 '2,588',
 '217,407,528',
 '84,006',
 '64,794',
 '23,385',
 '8.4\nOct',
 '1990',
 '2,805',
 '236,966,400',
 '84,480',
 '65,307',
 '23,075',
 '8.3\nNov',
 '1990',
 '2,500',
 '214,427,500',
 '85,771',
 '45,500',
 '22,318',
 '8.1\nDec',
 '1990',
 '2,220',
 '194,241,120',
 '87,496',
 '65,513',
 '21,832',
 '8.1\nJan',
 '1991',
 '1,599',
 '139,685,442',
 '87,358',
 '66,642',
 '21,065',
 '8.0\nFeb',
 '1991',
 '1,940',
 '149,178,240',
 '76,896',
 '64,179',
 '22,044',
 '8.4\nMar',
 '1991',
 '2,191',
 '204,163,953',
 '93,183',
 '72,286',
 '22,762',
 '8.7\nApr',
 '1991',
 '2,640',
 '234,511,200',
 '88,830',
 '67,565',
 '23,707',
 '9.1\nMay',
 '1991',
 '3,233',
 '303,843,806',
 '93,982',
 '77,110',
 '24,357',
 '9.2\nJun',
 '1991',
 '3,184',
 '303,100,880',
 '95,195',
 '74,339',
 '25,315',
 '9.6\nJul',
 '1991',
 '3,121',
 '304,403,614',
 '97,534',
 '76,596',
 '24,571',
 '9.3\nAug',
 '1991',
 '3,287',
 '308,777,493',
 '93,939',
 '66,847',
 '24,253',
 '9.3\nSep',
 '1991',
 '2,655',
 '233,942,670',
 '88,114',
 '79,162',
 '24,099',
 '9.2\nOct',
 '1991',
 '2,481',
 '229,700,904',
 '92,584',
 '70,952',
 '23,485',
 '9.1\nNov',
 '1991',
 '2,695',
 '185,318,980',
 '68,764',
 '65,000',
 '22,534',
 '8.7\nDec',
 '1991',
 '2,370',
 '225,346,710',
 '95,083',
 '72,286',
 '19,969',
 '7.6\nJan',
 '1992',
 '1,544',
 '135,592,536',
 '87,819',
 '74,647',
 '22,612',
 '8.7\nFeb',
 '1992',
 '1,677',
 '183,571,128',
 '109,464',
 '73,723',
 '23,529',
 '9.1\nMar',
 '1992',
 '2,420',
 '247,353,040',
 '102,212',
 '77,315',
 '24,665',
 '9.5\nApr',
 '1992',
 '2,439',
 '244,963,404',
 '100,436',
 '76,904',
 '25,810',
 '10.0\nMay',
 '1992',
 '2,818',
 '271,776,374',
 '96,443',
 '81,420',
 '26,446',
 '10.3\nJun',
 '1992',
 '2,938',
 '291,208,684',
 '99,118',
 '70,439',
 '26,678',
 '10.5\nJul',
 '1992',
 '2,952',
 '283,418,568',
 '96,009',
 '77,007',
 '27,160',
 '10.8\nAug',
 '1992',
 '2,954',
 '287,568,946',
 '97,349',
 '75,262',
 '26,270',
 '10.5\nSep',
 '1992',
 '2,558',
 '247,210,236',
 '96,642',
 '81,112',
 '25,856',
 '10.4\nOct',
 '1992',
 '2,114',
 '205,601,298',
 '97,257',
 '78,136',
 '25,004',
 '10.2\nNov',
 '1992',
 '2,283',
 '197,963,496',
 '86,712',
 '81,523',
 '24,003',
 '9.9\nDec',
 '1992',
 '2,368',
 '220,747,328',
 '93,221',
 '79,675',
 '22,001',
 '9.1\nJan',
 '1993',
 '1,506',
 '149,425,320',
 '99,220',
 '73,415',
 '24,979',
 '10.3\nFeb',
 '1993',
 '1,864',
 '184,741,040',
 '99,110',
 '77,007',
 '25,504',
 '10.5\nMar',
 '1993',
 '2,123',
 '219,870,618',
 '103,566',
 '78,752',
 '25,964',
 '10.8\nApr',
 '1993',
 '2,304',
 '232,300,800',
 '100,825',
 '77,212',
 '27,005',
 '11.3\nMay',
 '1993',
 '2,535',
 '270,738,000',
 '106,800',
 '80,496',
 '26,505',
 '11.2\nJun',
 '1993',
 '3,091',
 '335,364,227',
 '108,497',
 '80,599',
 '26,115',
 '10.9\nJul',
 '1993',
 '3,017',
 '325,836,000',
 '108,000',
 '81,112',
 '26,056',
 '10.9\nAug',
 '1993',
 '3,072',
 '323,149,824',
 '105,192',
 '79,983',
 '25,728',
 '10.7\nSep',
 '1993',
 '2,563',
 '264,901,428',
 '103,356',
 '78,238',
 '24,881',
 '10.4\nOct',
 '1993',
 '2,535',
 '263,855,475',
 '104,085',
 '79,059',
 '24,654',
 '10.1\nNov',
 '1993',
 '2,394',
 '246,749,580',
 '103,070',
 '79,470',
 '23,849',
 '9.7\nDec',
 '1993',
 '2,741',
 '297,894,621',
 '108,681',
 '78,136',
 '21,869',
 '8.8\nJan',
 '1994',
 '1,705',
 '178,308,900',
 '104,580',
 '74,133',
 '23,254',
 '9.3\nFeb',
 '1994',
 '1,948',
 '203,242,632',
 '104,334',
 '76,904',
 '23,786',
 '9.5\nMar',
 '1994',
 '2,762',
 '286,609,978',
 '103,769',
 '77,007',
 '24,675',
 '9.7\nApr',
 '1994',
 '2,803',
 '289,496,643',
 '103,281',
 '78,136',
 '25,084',
 '9.7\nMay',
 '1994',
 '3,090',
 '318,223,650',
 '102,985',
 '78,854',
 '25,835',
 '9.8\nJun',
 '1994',
 '3,316',
 '361,898,292',
 '109,137',
 '80,188',
 '25,858',
 '9.7\nJul',
 '1994',
 '2,896',
 '300,793,040',
 '103,865',
 '79,367',
 '26,009',
 '9.8\nAug',
 '1994',
 '3,126',
 '343,478,628',
 '109,878',
 '79,367',
 '25,663',
 '9.7\nSep',
 '1994',
 '2,595',
 '264,757,470',
 '102,026',
 '75,775',
 '25,323',
 '9.5\nOct',
 '1994',
 '2,322',
 '227,530,458',
 '97,989',
 '74,133',
 '24,395',
 '9.2\nNov',
 '1994',
 '2,278',
 '222,079,942',
 '97,489',
 '73,107',
 '22,978',
 '8.7\nDec',
 '1994',
 '2,440',
 '258,996,240',
 '106,146',
 '75,468',
 '21,374',
 '8.2\nJan',
 '1995',
 '1,564',
 '163,486,484',
 '104,531',
 '74,749',
 '22,486',
 '8.7\nFeb',
 '1995',
 '1,853',
 '189,613,784',
 '102,328',
 '74,133',
 '23,400',
 '9.0\nMar',
 '1995',
 '2,495',
 '256,648,175',
 '102,865',
 '75,160',
 '24,127',
 '9.4\nApr',
 '1995',
 '2,257',
 '229,670,063',
 '101,759',
 '75,570',
 '24,373',
 '9.7\nMay',
 '1995',
 '3,151',
 '317,869,729',
 '100,879',
 '73,825',
 '24,444',
 '9.7\nJun',
 '1995',
 '3,328',
 '356,964,608',
 '107,261',
 '78,854',
 '24,330',
 '9.6\nJul',
 '1995',
 '3,268',
 '335,270,656',
 '102,592',
 '78,649',
 '24,255',
 '9.5\nAug',
 '1995',
 '3,631',
 '393,190,097',
 '108,287',
 '81,933',
 '23,532',
 '9.1\nSep',
 '1995',
 '2,833',
 '287,965,951',
 '101,647',
 '77,315',
 '23,042',
 '8.8\nOct',
 '1995',
 '2,741',
 '283,762,025',
 '103,525',
 '75,673',
 '22,608',
 '8.5\nNov',
 '1995',
 '2,528',
 '254,498,816',
 '100,672',
 '78,341',
 '21,857',
 '8.2\nDec',
 '1995',
 '2,615',
 '282,378,160',
 '107,984',
 '78,957',
 '20,418',
 '7.6\nJan',
 '1996',
 '1,839',
 '182,335,011',
 '99,149',
 '75,775',
 '21,381',
 '7.9\nFeb',
 '1996',
 '2,312',
 '248,551,560',
 '107,505',
 '79,675',
 '22,102',
 '8.0\nMar',
 '1996',
 '3,021',
 '323,219,811',
 '106,991',
 '80,496',
 '22,743',
 '8.1\nApr',
 '1996',
 '3,098',
 '338,939,788',
 '109,406',
 '81,625',
 '23,392',
 '8.2\nMay',
 '1996',
 '3,578',
 '402,757,570',
 '112,565',
 '82,446',
 '23,763',
 '8.2\nJun',
 '1996',
 '3,292',
 '377,167,732',
 '114,571',
 '83,165',
 '23,869',
 '8.2\nJul',
 '1996',
 '3,656',
 '412,484,544',
 '112,824',
 '84,807',
 '23,976',
 '8.2\nAug',
 '1996',
 '3,651',
 '410,332,239',
 '112,389',
 '83,575',
 '23,160',
 '7.9\nSep',
 '1996',
 '2,837',
 '314,274,349',
 '110,777',
 '81,933',
 '22,631',
 '7.7\nOct',
 '1996',
 '2,867',
 '318,480,695',
 '111,085',
 '81,009',
 '22,173',
 '7.5\nNov',
 '1996',
 '2,560',
 '278,236,160',
 '108,686',
 '80,599',
 '21,339',
 '7.2\nDec',
 '1996',
 '2,946',
 '352,783,500',
 '119,750',
 '87,578',
 '19,662',
 '6.6\nJan',
 '1997',
 '1,964',
 '227,772,936',
 '115,974',
 '83,575',
 '20,066',
 '6.7\nFeb',
 '1997',
 '2,324',
 '259,272,412',
 '111,563',
 '84,499',
 '20,466',
 '6.9\nMar',
 '1997',
 '2,888',
 '328,977,856',
 '113,912',
 '85,422',
 '21,163',
 '7.1\nApr',
 '1997',
 '3,122',
 '356,800,892',
 '114,286',
 '84,088',
 '21,501',
 '7.2\nMay',
 '1997',
 '3,679',
 '433,853,433',
 '117,927',
 '87,988',
 '21,745',
 '7.3\nJun',
 '1997',
 '3,884',
 '477,199,892',
 '122,863',
 '91,683',
 '21,397',
 '7.1\nJul',
 '1997',
 '4,106',
 '509,341,088',
 '124,048',
 '91,169',
 '21,131',
 '6.9\nAug',
 '1997',
 '3,918',
 '488,782,254',
 '124,753',
 '90,656',
 '20,450',
 '6.6\nSep',
 '1997',
 '3,503',
 '422,398,746',
 '120,582',
 '89,220',
 '19,557',
 '6.2\nOct',
 '1997',
 '3,535',
 '415,970,520',
 '117,672',
 '87,783',
 '18,635',
 '5.8\nNov',
 '1997',
 '2,802',
 '327,834,000',
 '117,000',
 '85,935',
 '18,498',
 '5.7\nDec',
 '1997',
 '3,589',
 '447,580,601',
 '124,709',
 '92,709',
 '17,497',
 '5.3\nJan',
 '1998',
 '2,240',
 '257,210,240',
 '114,826',
 '86,141',
 '16,997',
 '5.2\nFeb',
 '1998',
 '2,974',
 '356,118,656',
 '119,744',
 '90,451',
 '16,837',
 '5.0\nMar',
 '1998',
 '3,989',
 '492,517,841',
 '123,469',
 '91,785',
 '16,924',
 '4.9\nApr',
 '1998',
 '3,968',
 '484,365,824',
 '122,068',
 '91,272',
 '16,641',
 '4.7\nMay',
 '1998',
 '4,385',
 '575,088,365',
 '131,149',
 '94,659',
 '16,486',
 '4.6\nJun',
 '1998',
 '5,064',
 '677,897,424',
 '133,866',
 '98,969',
 '16,419',
 '4.5\nJul',
 '1998',
 '5,053',
 '676,915,039',
 '133,963',
 '97,738',
 '16,374',
 '4.4\nAug',
 '1998',
 '4,594',
 '583,479,346',
 '127,009',
 '97,327',
 '15,997',
 '4.2\nSep',
 '1998',
 '3,863',
 '484,037,763',
 '125,301',
 '92,196',
 '15,403',
 '4.0\nOct',
 '1998',
 '3,590',
 '456,299,770',
 '127,103',
 '93,427',
 '15,144',
 '3.9\nNov',
 '1998',
 '3,397',
 '423,079,365',
 '124,545',
 '92,606',
 '14,307',
 '3.7\nDec',
 '1998',
 '4,027',
 '521,178,367',
 '129,421',
 '96,096',
 '13,498',
 '3.4\nJan',
 '1999',
 '2,448',
 '290,012,112',
 '118,469',
 '89,527',
 '13,748',
 '3.5\nFeb',
 '1999',
 '3,129',
 '398,775,405',
 '127,445',
 '95,377',
 '13,844',
 '3.5\nMar',
 '1999',
 '4,309',
 '564,556,562',
 '131,018',
 '97,943',
 '13,938',
 '3.5\nApr',
 '1999',
 '4,282',
 '571,248,774',
 '133,407',
 '98,969',
 '14,005',
 '3.5\nMay',
 '1999',
 '4,562',
 '634,460,150',
 '139,075',
 '104,511',
 '14,333',
 '3.6\nJun',
 '1999',
 '5,442',
 '795,152,388',
 '146,114',
 '107,385',
 '14,871',
 '3.7\nJul',
 '1999',
 '5,083',
 '716,128,621',
 '140,887',
 '105,948',
 '15,438',
 '3.8\nAug',
 '1999',
 '4,946',
 '692,776,328',
 '140,068',
 '101,330',
 '15,627',
 '3.8\nSep',
 '1999',
 '4,071',
 '558,773,247',
 '137,257',
 '101,330',
 '15,703',
 '3.8\nOct',
 '1999',
 '3,871',
 '506,160,347',
 '130,757',
 '97,943',
 '15,850',
 '3.8\nNov',
 '1999',
 '3,580',
 '490,739,240',
 '137,078',
 '100,919',
 '15,381',
 '3.7\nDec',
 '1999',
 '4,002',
 '571,889,802',
 '142,901',
 '102,561',
 '14,642',
 '3.5\nJan',
 '2000',
 '2,564',
 '367,941,692',
 '143,503',
 '102,151',
 '15,264',
 '3.7\nFeb',
 '2000',
 '3,564',
 '517,303,908',
 '145,147',
 '110,156',
 '15,429',
 '3.7\nMar',
 '2000',
 '4,576',
 '684,711,456',
 '149,631',
 '109,334',
 '15,554',
 '3.7\nApr',
 '2000',
 '4,219',
 '627,167,007',
 '148,653',
 '110,669',
 '16,212',
 '3.9\nMay',
 '2000',
 '5,042',
 '782,649,492',
 '155,226',
 '112,619',
 '16,958',
 '4.0\nJun',
 '2000',
 '5,468',
 '858,448,660',
 '156,995',
 '117,955',
 '17,456',
 '4.1\nJul',
 '2000',
 '4,843',
 '744,538,605',
 '153,735',
 '118,366',
 '17,889',
 '4.2\nAug',
 '2000',
 '4,964',
 '773,698,968',
 '155,862',
 '114,568',
 '18,032',
 '4.3\nSep',
 '2000',
 '4,120',
 '649,736,360',
 '157,703',
 '115,903',
 '18,056',
 '4.3\nOct',
 '2000',
 '3,933',
 '600,470,775',
 '152,675',
 '112,311',
 '18,250',
 '4.3\nNov',
 '2000',
 '3,605',
 '552,033,650',
 '153,130',
 '115,184',
 '17,688',
 '4.2\nDec',
 '2000',
 '3,818',
 '612,094,124',
 '160,318',
 '119,392',
 '16,793',
 '4.0\nJan',
 '2001',
 '2,695',
 '397,437,040',
 '147,472',
 '111,798',
 '17,595',
 '4.2\nFeb',
 '2001',
 '3,378',
 '520,323,474',
 '154,033',
 '114,363',
 '18,126',
 '4.3\nMar',
 '2001',
 '4,534',
 '715,274,772',
 '157,758',
 '116,313',
 '18,986',
 '4.5\nApr',
 '2001',
 '4,541',
 '725,511,029',
 '159,769',
 '122,471',
 '19,806',
 '4.7\nMay',
 '2001',
 '5,255',
 '828,676,715',
 '157,693',
 '122,676',
 '20,213',
 '4.7\nJun',
 '2001',
 '5,319',
 '881,735,949',
 '165,771',
 '127,807',
 '20,395',
 '4.8\nJul',
 '2001',
 '5,245',
 '875,505,890',
 '166,922',
 '127,807',
 '20,291',
 '4.7\nAug',
 '2001',
 '5,361',
 '855,712,098',
 '159,618',
 '124,421',
 '20,371',
 '4.7\nSep',
 '2001',
 '3,913',
 '607,790,638',
 '155,326',
 '119,802',
 '20,429',
 '4.8\nOct',
 '2001',
 '3,949',
 '597,076,953',
 '151,197',
 '117,134',
 '20,488',
 ...]

In [18]:
#Function to slice the raw data
def slice_per(source, step):
    return [source[i::step] for i in range(step)]

In [19]:
List_sliced_Data = slice_per(table_data_split, 7)

In [20]:
Table_df = pd.DataFrame({
    "Date":List_sliced_Data[0],
    "Sales":List_sliced_Data[1],
    "Dollar Volume":List_sliced_Data[2],
    "HOU Average Price":List_sliced_Data[3],
    "Median Price":List_sliced_Data[4],
    "Total Listings":List_sliced_Data[5],
    "Months Inventory":List_sliced_Data[6]
})

In [21]:
#View of the DataFrame
Table_df.head()

,Date,Sales,Dollar Volume,HOU Average Price,Median Price,Total Listings,Months Inventory
0,Date,Sales,Dollar\nVolume,Average\nPrice,Median\nPrice,Total\nListings,Months\nInventory\nJan
1,1990,"2,500","214,427,500","85,771","45,500","22,318",8.9\nFeb
2,1990,"1,935","171,518,400","88,640","66,231","23,191",10.5\nMar
3,1990,"2,554","219,963,250","86,125","67,052","24,247",10.4\nApr
4,1990,"2,434","221,267,638","90,907","66,949","24,709",10.5\nMay

In [22]:
Table_df_Clean = Table_df.drop([0])
Table_df_Clean

,Date,Sales,Dollar Volume,HOU Average Price,Median Price,Total Listings,Months Inventory
1,1990,"2,500","214,427,500","85,771","45,500","22,318",8.9\nFeb
2,1990,"1,935","171,518,400","88,640","66,231","23,191",10.5\nMar
3,1990,"2,554","219,963,250","86,125","67,052","24,247",10.4\nApr
4,1990,"2,434","221,267,638","90,907","66,949","24,709",10.5\nMay
5,1990,"2,999","258,048,955","86,045","65,923","25,390",10.2\nJun
...,...,...,...,...,...,...,...
387,2022,"10,085","4,088,374,167","405,392","330,000","10,839",1.1\nApr
388,2022,"9,337","3,942,527,921","422,248","340,870","12,182",1.3\nMay
389,2022,"9,988","4,340,285,197","434,550","350,000","13,692",1.5\nJun
390,2022,"10,123","4,362,282,525","430,928","351,330","17,689",1.9\nJul
391,2022,"8,438","3,556,597,847","421,498","345,000","21,399",2.3

In [23]:
Table_df_Clean2 = Table_df_Clean[['Date','HOU Average Price', 'Months Inventory']]
Table_df_Clean2

     Date HOU Average Price Months Inventory
1    1990            85,771         8.9\nFeb
2    1990            88,640        10.5\nMar
3    1990            86,125        10.4\nApr
4    1990            90,907        10.5\nMay
5    1990            86,045        10.2\nJun
..    ...               ...              ...
387  2022           405,392         1.1\nApr
388  2022           422,248         1.3\nMay
389  2022           434,550         1.5\nJun
390  2022           430,928         1.9\nJul
391  2022           421,498              2.3

[391 rows x 3 columns]

In [24]:
Table_df_Clean2 = Table_df_Clean2.astype({'Date':int},errors = 'raise')
Table_df_Clean2['Date'].dtypes

dtype('int32')

In [25]:
Table_df_Clean2021_only = Table_df_Clean2.loc[(Table_df_Clean2['Date'] == 2021),:]

In [26]:
Table_df_Clean2021_only

     Date HOU Average Price Months Inventory
373  2021           322,682         1.8\nFeb
374  2021           346,839         1.6\nMar
375  2021           365,523         1.4\nApr
376  2021           367,353         1.4\nMay
377  2021           382,193         1.3\nJun
378  2021           390,387         1.5\nJul
379  2021           383,873         1.8\nAug
380  2021           375,884         1.8\nSep
381  2021           369,225         1.7\nOct
382  2021           373,881         1.7\nNov
383  2021           379,872         1.5\nDec
384  2021           386,724         1.4\nJan

In [27]:
Table_df_Clean2021_only["Date"]= Table_df_Clean2021_only["Date"].astype(str)+"-"+Table_df_Clean2021_only["Months Inventory"].str[-3:]
Table_df_Clean2021_only.head()

C:\Users\HOBBYD~1\AppData\Local\Temp/ipykernel_75480/2738657502.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Table_df_Clean2021_only["Date"]= Table_df_Clean2021_only["Date"].astype(str)+"-"+Table_df_Clean2021_only["Months Inventory"].str[-3:]

         Date HOU Average Price Months Inventory
373  2021-Feb           322,682         1.8\nFeb
374  2021-Mar           346,839         1.6\nMar
375  2021-Apr           365,523         1.4\nApr
376  2021-May           367,353         1.4\nMay
377  2021-Jun           382,193         1.3\nJun

In [28]:
#Final Clean Data for Houston
Table_df_Clean2021_only_Final = Table_df_Clean2021_only[['Date','HOU Average Price']]
Table_df_Clean2021_only_Final

         Date HOU Average Price
373  2021-Feb           322,682
374  2021-Mar           346,839
375  2021-Apr           365,523
376  2021-May           367,353
377  2021-Jun           382,193
378  2021-Jul           390,387
379  2021-Aug           383,873
380  2021-Sep           375,884
381  2021-Oct           369,225
382  2021-Nov           373,881
383  2021-Dec           379,872
384  2021-Jan           386,724

### San Antonio and Surrounding Areas

In [29]:
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

In [30]:
SATX_url = "https://www.recenter.tamu.edu/data/housing-activity/#!/activity/MSA/San_Antonio-New_Braunfels"
    
# Call visit on our browser and pass in the URL we want to scrape   
browser.visit(SATX_url)

In [31]:
SATX_table_data = browser.find_by_xpath('//*[@id="WebPartWPQ1"]/div[1]/div/div[2]/table').text

In [32]:
SATX_table_data[0]
SATX_table_data_split = SATX_table_data.split(" ")

In [33]:
SATX_table_data_split

['Date',
 'Sales',
 'Dollar\nVolume',
 'Average\nPrice',
 'Median\nPrice',
 'Total\nListings',
 'Months\nInventory\nJan',
 '1990',
 '478',
 '35,062,256',
 '73,352',
 '63,830',
 '8,211',
 '17.2\nFeb',
 '1990',
 '363',
 '27,456,231',
 '75,637',
 '60,258',
 '9,280',
 '22.1\nMar',
 '1990',
 '553',
 '45,066,182',
 '81,494',
 '61,548',
 '9,335',
 '20.1\nApr',
 '1990',
 '429',
 '38,545,221',
 '89,849',
 '59,067',
 '9,545',
 '20.9\nMay',
 '1990',
 '537',
 '48,376,719',
 '90,087',
 '62,143',
 '9,588',
 '20.3\nJun',
 '1990',
 '682',
 '50,826,732',
 '74,526',
 '62,540',
 '9,221',
 '18.2\nJul',
 '1990',
 '638',
 '51,613,562',
 '80,899',
 '61,945',
 '9,087',
 '17.3\nAug',
 '1990',
 '776',
 '61,661,736',
 '79,461',
 '66,013',
 '8,751',
 '15.7\nSep',
 '1990',
 '490',
 '37,656,500',
 '76,850',
 '65,219',
 '8,731',
 '15.9\nOct',
 '1990',
 '468',
 '32,604,624',
 '69,668',
 '59,464',
 '8,580',
 '15.8\nNov',
 '1990',
 '478',
 '35,062,256',
 '73,352',
 '63,830',
 '8,211',
 '15.3\nDec',
 '1990',
 '430',
 '31,855,260',
 '74,082',
 '60,853',
 '7,983',
 '15.2\nJan',
 '1991',
 '353',
 '24,352,058',
 '68,986',
 '56,587',
 '7,875',
 '15.3\nFeb',
 '1991',
 '405',
 '31,163,535',
 '76,947',
 '59,167',
 '7,680',
 '14.8\nMar',
 '1991',
 '587',
 '42,516,410',
 '72,430',
 '60,357',
 '7,784',
 '14.9\nApr',
 '1991',
 '496',
 '37,004,576',
 '74,606',
 '61,250',
 '7,479',
 '14.2\nMay',
 '1991',
 '627',
 '53,204,085',
 '84,855',
 '61,746',
 '7,050',
 '13.2\nJun',
 '1991',
 '578',
 '46,303,002',
 '80,109',
 '64,326',
 '6,914',
 '13.1\nJul',
 '1991',
 '622',
 '52,700,194',
 '84,727',
 '70,379',
 '6,790',
 '12.9\nAug',
 '1991',
 '745',
 '67,351,725',
 '90,405',
 '68,295',
 '6,651',
 '12.7\nSep',
 '1991',
 '494',
 '42,849,066',
 '86,739',
 '66,112',
 '6,306',
 '12.0\nOct',
 '1991',
 '506',
 '37,988,456',
 '75,076',
 '58,075',
 '6,182',
 '11.7\nNov',
 '1991',
 '538',
 '42,574,092',
 '79,134',
 '66,707',
 '5,976',
 '11.2\nDec',
 '1991',
 '480',
 '39,295,200',
 '81,865',
 '67,005',
 '5,808',
 '10.8\nJan',
 '1992',
 '402',
 '31,487,856',
 '78,328',
 '64,921',
 '5,904',
 '10.9\nFeb',
 '1992',
 '423',
 '35,107,731',
 '82,997',
 '70,081',
 '6,040',
 '11.2\nMar',
 '1992',
 '639',
 '52,394,166',
 '81,994',
 '68,196',
 '6,186',
 '11.3\nApr',
 '1992',
 '503',
 '40,660,508',
 '80,836',
 '67,005',
 '6,298',
 '11.5\nMay',
 '1992',
 '490',
 '41,624,030',
 '84,947',
 '65,418',
 '6,265',
 '11.7\nJun',
 '1992',
 '736',
 '62,732,960',
 '85,235',
 '72,760',
 '6,231',
 '11.4\nJul',
 '1992',
 '701',
 '59,181,224',
 '84,424',
 '72,859',
 '6,122',
 '11.0\nAug',
 '1992',
 '622',
 '54,181,798',
 '87,109',
 '74,844',
 '5,997',
 '11.0\nSep',
 '1992',
 '629',
 '53,964,426',
 '85,794',
 '72,264',
 '5,821',
 '10.5\nOct',
 '1992',
 '475',
 '39,443,050',
 '83,038',
 '67,600',
 '5,855',
 '10.6\nNov',
 '1992',
 '617',
 '52,188,945',
 '84,585',
 '69,486',
 '5,784',
 '10.3\nDec',
 '1992',
 '658',
 '64,686,664',
 '98,308',
 '71,371',
 '5,602',
 '9.7\nJan',
 '1993',
 '438',
 '40,381,410',
 '92,195',
 '71,966',
 '5,591',
 '9.7\nFeb',
 '1993',
 '562',
 '47,283,870',
 '84,135',
 '68,097',
 '5,551',
 '9.4\nMar',
 '1993',
 '476',
 '42,306,880',
 '88,880',
 '73,256',
 '5,604',
 '9.7\nApr',
 '1993',
 '522',
 '48,576,798',
 '93,059',
 '76,431',
 '5,468',
 '9.5\nMay',
 '1993',
 '719',
 '75,316,688',
 '104,752',
 '75,836',
 '5,506',
 '9.2\nJun',
 '1993',
 '865',
 '86,241,365',
 '99,701',
 '77,721',
 '5,386',
 '8.9\nJul',
 '1993',
 '637',
 '71,717,282',
 '112,586',
 '80,598',
 '5,380',
 '8.9\nAug',
 '1993',
 '684',
 '63,560,016',
 '92,924',
 '77,820',
 '5,382',
 '8.9\nSep',
 '1993',
 '656',
 '59,017,040',
 '89,965',
 '76,530',
 '5,279',
 '8.7\nOct',
 '1993',
 '600',
 '54,940,800',
 '91,568',
 '73,554',
 '5,227',
 '8.4\nNov',
 '1993',
 '589',
 '56,068,677',
 '95,193',
 '75,240',
 '5,074',
 '8.2\nDec',
 '1993',
 '702',
 '62,664,030',
 '89,265',
 '74,248',
 '4,951',
 '8.0\nJan',
 '1994',
 '473',
 '43,572,760',
 '92,120',
 '74,645',
 '5,008',
 '8.0\nFeb',
 '1994',
 '455',
 '43,126,265',
 '94,783',
 '72,859',
 '5,046',
 '8.2\nMar',
 '1994',
 '759',
 '74,564,919',
 '98,241',
 '76,034',
 '5,164',
 '8.1\nApr',
 '1994',
 '608',
 '55,539,584',
 '91,348',
 '75,240',
 '5,278',
 '8.2\nMay',
 '1994',
 '593',
 '58,351,793',
 '98,401',
 '78,416',
 '5,456',
 '8.6\nJun',
 '1994',
 '949',
 '90,241,359',
 '95,091',
 '78,614',
 '5,447',
 '8.5\nJul',
 '1994',
 '566',
 '56,185,122',
 '99,267',
 '77,919',
 '5,495',
 '8.6\nAug',
 '1994',
 '715',
 '79,436,500',
 '111,100',
 '79,011',
 '5,546',
 '8.7\nSep',
 '1994',
 '670',
 '62,779,670',
 '93,701',
 '77,126',
 '5,519',
 '8.6\nOct',
 '1994',
 '509',
 '46,367,864',
 '91,096',
 '73,951',
 '5,578',
 '8.8\nNov',
 '1994',
 '484',
 '44,033,836',
 '90,979',
 '78,217',
 '5,474',
 '8.8\nDec',
 '1994',
 '594',
 '60,497,118',
 '101,847',
 '75,637',
 '5,277',
 '8.6\nJan',
 '1995',
 '426',
 '51,255,042',
 '120,317',
 '75,637',
 '5,323',
 '8.7\nFeb',
 '1995',
 '445',
 '41,324,480',
 '92,864',
 '75,340',
 '5,454',
 '8.9\nMar',
 '1995',
 '697',
 '64,036,875',
 '91,875',
 '74,447',
 '5,766',
 '9.5\nApr',
 '1995',
 '425',
 '40,173,550',
 '94,526',
 '75,538',
 '6,077',
 '10.3\nMay',
 '1995',
 '504',
 '47,895,120',
 '95,030',
 '77,919',
 '6,266',
 '10.8\nJun',
 '1995',
 '727',
 '72,392,479',
 '99,577',
 '82,484',
 '6,321',
 '11.2\nJul',
 '1995',
 '656',
 '66,212,704',
 '100,934',
 '85,956',
 '6,441',
 '11.3\nAug',
 '1995',
 '815',
 '83,153,635',
 '102,029',
 '81,988',
 '6,395',
 '11.0\nSep',
 '1995',
 '660',
 '64,647,660',
 '97,951',
 '83,277',
 '6,396',
 '11.1\nOct',
 '1995',
 '566',
 '56,146,634',
 '99,199',
 '81,392',
 '6,475',
 '11.1\nNov',
 '1995',
 '584',
 '60,800,824',
 '104,111',
 '79,606',
 '6,391',
 '10.8\nDec',
 '1995',
 '612',
 '61,097,184',
 '99,832',
 '80,301',
 '6,276',
 '10.6\nJan',
 '1996',
 '544',
 '54,881,984',
 '100,886',
 '82,484',
 '7,040',
 '11.7\nFeb',
 '1996',
 '671',
 '63,730,238',
 '94,978',
 '80,698',
 '7,118',
 '11.4\nMar',
 '1996',
 '888',
 '89,471,328',
 '100,756',
 '83,178',
 '7,182',
 '11.3\nApr',
 '1996',
 '991',
 '95,917,899',
 '96,789',
 '81,591',
 '7,592',
 '11.1\nMay',
 '1996',
 '1,073',
 '107,818,259',
 '100,483',
 '82,781',
 '7,744',
 '10.6\nJun',
 '1996',
 '1,125',
 '120,042,000',
 '106,704',
 '87,246',
 '7,744',
 '10.1\nJul',
 '1996',
 '1,149',
 '120,877,098',
 '105,202',
 '84,666',
 '7,761',
 '9.6\nAug',
 '1996',
 '1,103',
 '114,571,919',
 '103,873',
 '85,559',
 '7,841',
 '9.4\nSep',
 '1996',
 '914',
 '91,623,930',
 '100,245',
 '83,575',
 '7,780',
 '9.1\nOct',
 '1996',
 '857',
 '90,101,552',
 '105,136',
 '83,277',
 '7,722',
 '8.8\nNov',
 '1996',
 '722',
 '76,239,590',
 '105,595',
 '85,758',
 '7,533',
 '8.5\nDec',
 '1996',
 '835',
 '85,975,775',
 '102,965',
 '84,170',
 '7,168',
 '7.9\nJan',
 '1997',
 '644',
 '72,773,288',
 '113,002',
 '88,437',
 '7,480',
 '8.2\nFeb',
 '1997',
 '666',
 '67,788,144',
 '101,784',
 '81,491',
 '7,694',
 '8.4\nMar',
 '1997',
 '895',
 '91,464,525',
 '102,195',
 '83,277',
 '8,104',
 '8.9\nApr',
 '1997',
 '908',
 '90,061,796',
 '99,187',
 '81,591',
 '8,310',
 '9.2\nMay',
 '1997',
 '1,018',
 '109,660,996',
 '107,722',
 '88,834',
 '8,315',
 '9.2\nJun',
 '1997',
 '1,124',
 '122,800,372',
 '109,253',
 '87,445',
 '8,362',
 '9.3\nJul',
 '1997',
 '1,189',
 '126,610,665',
 '106,485',
 '88,536',
 '8,401',
 '9.3\nAug',
 '1997',
 '1,187',
 '126,917,601',
 '106,923',
 '86,056',
 '8,104',
 '8.9\nSep',
 '1997',
 '951',
 '102,189,705',
 '107,455',
 '86,353',
 '7,946',
 '8.7\nOct',
 '1997',
 '1,025',
 '107,733,650',
 '105,106',
 '83,972',
 '7,742',
 '8.3\nNov',
 '1997',
 '809',
 '87,299,999',
 '107,911',
 '88,933',
 '7,542',
 '8.0\nDec',
 '1997',
 '972',
 '109,009,800',
 '112,150',
 '89,628',
 '7,460',
 '7.9\nJan',
 '1998',
 '680',
 '74,363,440',
 '109,358',
 '85,857',
 '7,627',
 '8.0\nFeb',
 '1998',
 '850',
 '87,733,600',
 '103,216',
 '82,781',
 '7,715',
 '8.0\nMar',
 '1998',
 '1,146',
 '118,695,804',
 '103,574',
 '82,186',
 '8,027',
 '8.1\nApr',
 '1998',
 '1,106',
 '118,903,848',
 '107,508',
 '86,651',
 '7,981',
 '7.9\nMay',
 '1998',
 '1,203',
 '133,336,911',
 '110,837',
 '89,528',
 '7,820',
 '7.7\nJun',
 '1998',
 '1,395',
 '165,041,055',
 '118,309',
 '92,009',
 '7,508',
 '7.2\nJul',
 '1998',
 '1,454',
 '165,590,244',
 '113,886',
 '92,803',
 '7,318',
 '6.9\nAug',
 '1998',
 '1,284',
 '145,624,860',
 '113,415',
 '93,299',
 '7,137',
 '6.7\nSep',
 '1998',
 '1,191',
 '126,634,266',
 '106,326',
 '84,369',
 '6,965',
 '6.4\nOct',
 '1998',
 '1,027',
 '110,277,206',
 '107,378',
 '85,460',
 '6,718',
 '6.1\nNov',
 '1998',
 '1,059',
 '112,387,434',
 '106,126',
 '84,766',
 '6,530',
 '5.9\nDec',
 '1998',
 '1,168',
 '127,422,960',
 '109,095',
 '88,338',
 '6,261',
 '5.5\nJan',
 '1999',
 '822',
 '86,940,474',
 '105,767',
 '85,758',
 '6,401',
 '5.6\nFeb',
 '1999',
 '998',
 '103,618,348',
 '103,826',
 '82,881',
 '6,489',
 '5.6\nMar',
 '1999',
 '1,342',
 '146,676,574',
 '109,297',
 '86,651',
 '6,601',
 '5.6\nApr',
 '1999',
 '1,333',
 '149,491,951',
 '112,147',
 '88,238',
 '6,705',
 '5.6\nMay',
 '1999',
 '1,379',
 '156,393,769',
 '113,411',
 '91,810',
 '6,681',
 '5.5\nJun',
 '1999',
 '1,673',
 '197,485,939',
 '118,043',
 '95,085',
 '6,624',
 '5.4\nJul',
 '1999',
 '1,508',
 '172,521,232',
 '114,404',
 '89,727',
 '6,487',
 '5.3\nAug',
 '1999',
 '1,521',
 '172,295,838',
 '113,278',
 '91,513',
 '6,394',
 '5.1\nSep',
 '1999',
 '1,312',
 '152,012,256',
 '115,863',
 '91,711',
 '6,256',
 '5.0\nOct',
 '1999',
 '1,117',
 '123,380,469',
 '110,457',
 '87,544',
 '6,193',
 '4.9\nNov',
 '1999',
 '1,089',
 '127,237,671',
 '116,839',
 '88,338',
 '6,060',
 '4.8\nDec',
 '1999',
 '1,181',
 '133,976,183',
 '113,443',
 '88,735',
 '5,822',
 '4.6\nJan',
 '2000',
 '821',
 '99,410,785',
 '121,085',
 '91,215',
 '5,901',
 '4.6\nFeb',
 '2000',
 '1,085',
 '122,474,800',
 '112,880',
 '86,353',
 '5,969',
 '4.7\nMar',
 '2000',
 '1,455',
 '170,930,490',
 '117,478',
 '87,345',
 '6,224',
 '4.8\nApr',
 '2000',
 '1,279',
 '147,678,456',
 '115,464',
 '90,521',
 '6,376',
 '5.0\nMay',
 '2000',
 '1,601',
 '187,102,466',
 '116,866',
 '91,513',
 '6,492',
 '5.0\nJun',
 '2000',
 '1,696',
 '215,134,208',
 '126,848',
 '100,343',
 '6,509',
 '5.0\nJul',
 '2000',
 '1,533',
 '189,449,673',
 '123,581',
 '100,740',
 '6,365',
 '4.9\nAug',
 '2000',
 '1,655',
 '199,644,305',
 '120,631',
 '93,696',
 '6,803',
 '5.2\nSep',
 '2000',
 '1,318',
 '159,321,158',
 '120,881',
 '95,085',
 '6,800',
 '5.2\nOct',
 '2000',
 '1,206',
 '143,778,114',
 '119,219',
 '93,795',
 '6,889',
 '5.2\nNov',
 '2000',
 '1,137',
 '135,334,836',
 '119,028',
 '94,390',
 '6,648',
 '5.0\nDec',
 '2000',
 '1,016',
 '124,349,256',
 '122,391',
 '97,069',
 '6,372',
 '4.8\nJan',
 '2001',
 '951',
 '106,761,162',
 '112,262',
 '88,238',
 '6,475',
 '4.9\nFeb',
 '2001',
 '1,120',
 '140,019,040',
 '125,017',
 '97,168',
 '6,700',
 '5.0\nMar',
 '2001',
 '1,507',
 '186,941,843',
 '124,049',
 '97,565',
 '6,821',
 '5.1\nApr',
 '2001',
 '1,392',
 '164,592,864',
 '118,242',
 '93,596',
 '6,945',
 '5.2\nMay',
 '2001',
 '1,663',
 '207,677,103',
 '124,881',
 '102,526',
 '7,114',
 '5.3\nJun',
 '2001',
 '1,793',
 '229,319,321',
 '127,897',
 '104,808',
 '7,301',
 '5.4\nJul',
 '2001',
 '1,644',
 '205,521,372',
 '125,013',
 '101,137',
 '7,252',
 '5.3\nAug',
 '2001',
 '1,664',
 '211,301,376',
 '126,984',
 '102,626',
 '7,046',
 '5.2\nSep',
 '2001',
 '1,172',
 '144,875,608',
 '123,614',
 '98,756',
 '6,958',
 '5.1\nOct',
 '2001',
 '1,258',
 '158,709,280',
 '126,160',
 '96,672',
 '6,813',
 ...]

In [34]:
def slice_per(source, step):
    return [source[i::step] for i in range(step)]

In [35]:
List_sliced_Data = slice_per(SATX_table_data_split, 7)

In [36]:
SATX_Table_df = pd.DataFrame({
    "Date":List_sliced_Data[0],
    "Sales":List_sliced_Data[1],
    "Dollar Volume":List_sliced_Data[2],
    "SATX Average Price":List_sliced_Data[3],
    "Median Price":List_sliced_Data[4],
    "Total Listings":List_sliced_Data[5],
    "Months Inventory":List_sliced_Data[6]
})

In [37]:
SATX_Table_df.head()

,Date,Sales,Dollar Volume,SATX Average Price,Median Price,Total Listings,Months Inventory
0,Date,Sales,Dollar\nVolume,Average\nPrice,Median\nPrice,Total\nListings,Months\nInventory\nJan
1,1990,478,"35,062,256","73,352","63,830","8,211",17.2\nFeb
2,1990,363,"27,456,231","75,637","60,258","9,280",22.1\nMar
3,1990,553,"45,066,182","81,494","61,548","9,335",20.1\nApr
4,1990,429,"38,545,221","89,849","59,067","9,545",20.9\nMay

In [38]:
SATX_Table_df_Clean = SATX_Table_df.drop([0])
SATX_Table_df_Clean

,Date,Sales,Dollar Volume,SATX Average Price,Median Price,Total Listings,Months Inventory
1,1990,478,"35,062,256","73,352","63,830","8,211",17.2\nFeb
2,1990,363,"27,456,231","75,637","60,258","9,280",22.1\nMar
3,1990,553,"45,066,182","81,494","61,548","9,335",20.1\nApr
4,1990,429,"38,545,221","89,849","59,067","9,545",20.9\nMay
5,1990,537,"48,376,719","90,087","62,143","9,588",20.3\nJun
...,...,...,...,...,...,...,...
387,2022,"3,652","1,330,776,996","364,397","314,990","3,979",1.1\nApr
388,2022,"3,427","1,316,207,612","384,070","322,000","4,655",1.3\nMay
389,2022,"3,716","1,440,982,410","387,778","338,000","5,530",1.6\nJun
390,2022,"3,811","1,517,319,861","398,142","339,900","7,200",2.1\nJul
391,2022,"3,512","1,348,971,103","384,103","328,000","8,956",2.6

In [39]:
SATX_Table_df_Clean2 = SATX_Table_df_Clean[['Date','SATX Average Price', 'Months Inventory']]
SATX_Table_df_Clean2

     Date SATX Average Price Months Inventory
1    1990             73,352        17.2\nFeb
2    1990             75,637        22.1\nMar
3    1990             81,494        20.1\nApr
4    1990             89,849        20.9\nMay
5    1990             90,087        20.3\nJun
..    ...                ...              ...
387  2022            364,397         1.1\nApr
388  2022            384,070         1.3\nMay
389  2022            387,778         1.6\nJun
390  2022            398,142         2.1\nJul
391  2022            384,103              2.6

[391 rows x 3 columns]

In [40]:
SATX_Table_df_Clean2 = SATX_Table_df_Clean2.astype({'Date':int},errors = 'raise')
SATX_Table_df_Clean2['Date'].dtypes

dtype('int32')

In [41]:
SATX_Table_df_Clean2021_only = SATX_Table_df_Clean2.loc[(SATX_Table_df_Clean2['Date'] == 2021),:]

In [42]:
SATX_Table_df_Clean2021_only

     Date SATX Average Price Months Inventory
373  2021            298,212         1.6\nFeb
374  2021            309,799         1.4\nMar
375  2021            312,571         1.2\nApr
376  2021            323,832         1.2\nMay
377  2021            334,964         1.2\nJun
378  2021            339,670         1.3\nJul
379  2021            344,579         1.6\nAug
380  2021            343,165         1.7\nSep
381  2021            342,042         1.7\nOct
382  2021            352,445         1.7\nNov
383  2021            357,122         1.6\nDec
384  2021            358,214         1.4\nJan

In [43]:
SATX_Table_df_Clean2021_only["Date"]= SATX_Table_df_Clean2021_only["Date"].astype(str)+"-"+ SATX_Table_df_Clean2021_only["Months Inventory"].str[-3:]
SATX_Table_df_Clean2021_only.head()

C:\Users\HOBBYD~1\AppData\Local\Temp/ipykernel_75480/2735484600.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  SATX_Table_df_Clean2021_only["Date"]= SATX_Table_df_Clean2021_only["Date"].astype(str)+"-"+ SATX_Table_df_Clean2021_only["Months Inventory"].str[-3:]

         Date SATX Average Price Months Inventory
373  2021-Feb            298,212         1.6\nFeb
374  2021-Mar            309,799         1.4\nMar
375  2021-Apr            312,571         1.2\nApr
376  2021-May            323,832         1.2\nMay
377  2021-Jun            334,964         1.2\nJun

In [44]:
#Final Clean Data for San Antonio
SATX_Table_df_Clean2021_only_Final = SATX_Table_df_Clean2021_only[['Date','SATX Average Price']]
SATX_Table_df_Clean2021_only_Final

         Date SATX Average Price
373  2021-Feb            298,212
374  2021-Mar            309,799
375  2021-Apr            312,571
376  2021-May            323,832
377  2021-Jun            334,964
378  2021-Jul            339,670
379  2021-Aug            344,579
380  2021-Sep            343,165
381  2021-Oct            342,042
382  2021-Nov            352,445
383  2021-Dec            357,122
384  2021-Jan            358,214

### Merging Houston and San Antonio Data

In [45]:
merged_cities = pd.merge(Table_df_Clean2021_only_Final, SATX_Table_df_Clean2021_only_Final, on="Date")

In [46]:
merged_cities

        Date HOU Average Price SATX Average Price
0   2021-Feb           322,682            298,212
1   2021-Mar           346,839            309,799
2   2021-Apr           365,523            312,571
3   2021-May           367,353            323,832
4   2021-Jun           382,193            334,964
5   2021-Jul           390,387            339,670
6   2021-Aug           383,873            344,579
7   2021-Sep           375,884            343,165
8   2021-Oct           369,225            342,042
9   2021-Nov           373,881            352,445
10  2021-Dec           379,872            357,122
11  2021-Jan           386,724            358,214

In [47]:
#Cleaning up the string values for calculation
merged_cities["HOU Average Price"] =merged_cities["HOU Average Price"].str.replace(',','')
merged_cities["SATX Average Price"] =merged_cities["SATX Average Price"].str.replace(',','')

#Calculating what monthly mortgage payment based on a 30yr loan

mthly_mortgage_HOU = merged_cities["HOU Average Price"].astype(int)/360
mthly_mortgage_SAT = merged_cities["SATX Average Price"].astype(int)/360

#Adding calculated monthly mortgage payment to the dataframe
merged_cities["Mthly Mortgage HOU (30yrs)"] = mthly_mortgage_HOU
merged_cities["Mthly Mortgage SAT (30yrs)"] = mthly_mortgage_SAT

In [48]:
merged_cities["Mthly Mortgage HOU (30yrs)"] = merged_cities["Mthly Mortgage HOU (30yrs)"].astype(float).map("${:,.2f}".format)
merged_cities["Mthly Mortgage SAT (30yrs)"] = merged_cities["Mthly Mortgage SAT (30yrs)"].astype(float).map("${:,.2f}".format)
merged_cities

,Date,HOU Average Price,SATX Average Price,Mthly Mortgage HOU (30yrs),Mthly Mortgage SAT (30yrs)
0,2021-Feb,322682,298212,$896.34,$828.37
1,2021-Mar,346839,309799,$963.44,$860.55
2,2021-Apr,365523,312571,"$1,015.34",$868.25
3,2021-May,367353,323832,"$1,020.42",$899.53
4,2021-Jun,382193,334964,"$1,061.65",$930.46
5,2021-Jul,390387,339670,"$1,084.41",$943.53
6,2021-Aug,383873,344579,"$1,066.31",$957.16
7,2021-Sep,375884,343165,"$1,044.12",$953.24
8,2021-Oct,369225,342042,"$1,025.62",$950.12
9,2021-Nov,373881,352445,"$1,038.56",$979.01
10,2021-Dec,379872,357122,"$1,055.20",$992.01
11,2021-Jan,386724,358214,"$1,074.23",$995.04

Based on the data above, it appears that the monthly cost to own is less than it is to rent a property in the associated area.

### Adding merged_cities dataframe to MongoDB

In [49]:
#Updating the MondoDB Collection with the data in the dataframe

owned_dict ={}

for row in merged_cities.index:
    #Creating the dictionary for the items in the dataframe
    owned_dict= {"date":merged_cities["Date"][row],
                  "Houston (owned)":merged_cities["Mthly Mortgage HOU (30yrs)"][row],
                  "San Antonio(owned)":merged_cities["Mthly Mortgage SAT (30yrs)"][row]}
    
    #Adding the dictionary to the database collection
    coll_Owned.insert_one(owned_dict)

In [50]:
# Display items in MongoDB collection
ownedTable = db.OwnedInfo.find()

for entry in ownedTable:
    print(entry)

{'_id': ObjectId('6323f9f944646eea70730d60'), 'date': '2021-Feb', 'Houston (owned)': '$896.34', 'San Antonio(owned)': '$828.37'}
{'_id': ObjectId('6323f9fa44646eea70730d61'), 'date': '2021-Mar', 'Houston (owned)': '$963.44', 'San Antonio(owned)': '$860.55'}
{'_id': ObjectId('6323f9fa44646eea70730d62'), 'date': '2021-Apr', 'Houston (owned)': '$1,015.34', 'San Antonio(owned)': '$868.25'}
{'_id': ObjectId('6323f9fa44646eea70730d63'), 'date': '2021-May', 'Houston (owned)': '$1,020.42', 'San Antonio(owned)': '$899.53'}
{'_id': ObjectId('6323f9fa44646eea70730d64'), 'date': '2021-Jun', 'Houston (owned)': '$1,061.65', 'San Antonio(owned)': '$930.46'}
{'_id': ObjectId('6323f9fa44646eea70730d65'), 'date': '2021-Jul', 'Houston (owned)': '$1,084.41', 'San Antonio(owned)': '$943.53'}
{'_id': ObjectId('6323f9fa44646eea70730d66'), 'date': '2021-Aug', 'Houston (owned)': '$1,066.31', 'San Antonio(owned)': '$957.16'}
{'_id': ObjectId('6323f9fa44646eea70730d67'), 'date': '2021-Sep', 'Houston (owned)': '$1,044.12', 'San Antonio(owned)': '$953.24'}
{'_id': ObjectId('6323f9fa44646eea70730d68'), 'date': '2021-Oct', 'Houston (owned)': '$1,025.62', 'San Antonio(owned)': '$950.12'}
{'_id': ObjectId('6323f9fa44646eea70730d69'), 'date': '2021-Nov', 'Houston (owned)': '$1,038.56', 'San Antonio(owned)': '$979.01'}
{'_id': ObjectId('6323f9fa44646eea70730d6a'), 'date': '2021-Dec', 'Houston (owned)': '$1,055.20', 'San Antonio(owned)': '$992.01'}
{'_id': ObjectId('6323f9fa44646eea70730d6b'), 'date': '2021-Jan', 'Houston (owned)': '$1,074.23', 'San Antonio(owned)': '$995.04'}